; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v9 ?v8)
             (pred_5 ?v4 ?v12)
             (pred_4 ?v9 ?v12)
             (pred_6 ?v10 ?v9 )
	     (pred_12 ?v9)
             (pred_8 ?v3)
             (pred_11 ?v4)
             (pred_3 ?v12)
             (pred_10 ?v9)
             (pred_9 ?v4)
             (pred_2 ?v9)
             (pred_1 ))



(:action op_4
:parameters (?v5 ?v1 ?v6 ?v2)
:precondition (and (pred_8 ?v5) (pred_8 ?v1) (pred_11 ?v6) (pred_3 ?v2)
          (pred_7 ?v5 ?v1) (pred_5 ?v6 ?v2)
                   (pred_4 ?v1 ?v2) (pred_12 ?v5) 
                   (pred_10 ?v1) (pred_9 ?v6))
:effect (and  (pred_2 ?v1) (not (pred_10 ?v1))))


(:action op_3
:parameters (?v5 ?v7)
:precondition (and (pred_8 ?v5) (pred_8 ?v7)
               (pred_12 ?v5) (pred_7 ?v5 ?v7) (pred_2 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v5))))

(:action op_1
:parameters (?v5 ?v6)
:precondition (and (pred_8 ?v5) (pred_11 ?v6) 
                  (pred_12 ?v5) (pred_6 ?v6 ?v5) (pred_1 ))
:effect (and (pred_9 ?v6)
   (not (pred_6 ?v6 ?v5)) (not (pred_1 ))))


(:action op_5
:parameters (?v5 ?v13 ?v11)
:precondition (and (pred_8 ?v5) (pred_11 ?v13) (pred_11 ?v11)
                  (pred_12 ?v5) (pred_9 ?v11) (pred_6 ?v13 ?v5))
:effect (and (pred_9 ?v13) (pred_6 ?v11 ?v5)
        (not (pred_9 ?v11)) (not (pred_6 ?v13 ?v5))))

(:action op_2
:parameters (?v5 ?v6)
:precondition (and (pred_8 ?v5) (pred_11 ?v6) 
                  (pred_12 ?v5) (pred_9 ?v6))
:effect (and (pred_1 ) (pred_6 ?v6 ?v5) (not (pred_9 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_01 obj_15 obj_20 obj_24 obj_31 obj_23 obj_08 obj_07 obj_22 obj_25 obj_29 obj_12 obj_21 obj_06 obj_19 obj_02 obj_30 obj_17 obj_32 obj_26 obj_04 obj_18 obj_03 obj_16 obj_28
    obj_11 obj_05 obj_13
    obj_10 obj_27 obj_09 obj_14
    )

    (:init
       (pred_1)

       (pred_8 obj_01)
       (pred_8 obj_15)
       (pred_8 obj_20)
       (pred_8 obj_24)
       (pred_8 obj_31)
       (pred_8 obj_23)
       (pred_8 obj_08)
       (pred_8 obj_07)
       (pred_8 obj_22)
       (pred_8 obj_25)
       (pred_8 obj_29)
       (pred_8 obj_12)
       (pred_8 obj_21)
       (pred_8 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_02)
       (pred_8 obj_30)
       (pred_8 obj_17)
       (pred_8 obj_32)
       (pred_8 obj_26)
       (pred_8 obj_04)
       (pred_8 obj_18)
       (pred_8 obj_03)
       (pred_8 obj_16)
       (pred_8 obj_28)
       (pred_3 obj_11)
       (pred_3 obj_05)
       (pred_3 obj_13)
       (pred_11 obj_10)
       (pred_11 obj_27)
       (pred_11 obj_09)
       (pred_11 obj_14)

       (pred_7 obj_01 obj_23)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_15 obj_08)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_20 obj_07)
       (pred_7 obj_20 obj_24)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_24 obj_22)
       (pred_7 obj_24 obj_31)
       (pred_7 obj_24 obj_20)
       (pred_7 obj_31 obj_25)
       (pred_7 obj_31 obj_24)
       (pred_7 obj_23 obj_29)
       (pred_7 obj_23 obj_08)
       (pred_7 obj_23 obj_01)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_08 obj_07)
       (pred_7 obj_08 obj_15)
       (pred_7 obj_08 obj_23)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_07 obj_22)
       (pred_7 obj_07 obj_20)
       (pred_7 obj_07 obj_08)
       (pred_7 obj_22 obj_06)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_22 obj_24)
       (pred_7 obj_22 obj_07)
       (pred_7 obj_25 obj_19)
       (pred_7 obj_25 obj_31)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_29 obj_02)
       (pred_7 obj_29 obj_12)
       (pred_7 obj_29 obj_23)
       (pred_7 obj_12 obj_30)
       (pred_7 obj_12 obj_21)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_12 obj_29)
       (pred_7 obj_21 obj_17)
       (pred_7 obj_21 obj_06)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_06 obj_32)
       (pred_7 obj_06 obj_19)
       (pred_7 obj_06 obj_22)
       (pred_7 obj_06 obj_21)
       (pred_7 obj_19 obj_26)
       (pred_7 obj_19 obj_25)
       (pred_7 obj_19 obj_06)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_02 obj_30)
       (pred_7 obj_02 obj_29)
       (pred_7 obj_30 obj_18)
       (pred_7 obj_30 obj_17)
       (pred_7 obj_30 obj_12)
       (pred_7 obj_30 obj_02)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_17 obj_32)
       (pred_7 obj_17 obj_21)
       (pred_7 obj_17 obj_30)
       (pred_7 obj_32 obj_16)
       (pred_7 obj_32 obj_26)
       (pred_7 obj_32 obj_06)
       (pred_7 obj_32 obj_17)
       (pred_7 obj_26 obj_28)
       (pred_7 obj_26 obj_19)
       (pred_7 obj_26 obj_32)
       (pred_7 obj_04 obj_18)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_30)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_03 obj_16)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_16 obj_28)
       (pred_7 obj_16 obj_32)
       (pred_7 obj_16 obj_03)
       (pred_7 obj_28 obj_26)
       (pred_7 obj_28 obj_16)
       (pred_10 obj_26)
       (pred_10 obj_31)
       (pred_10 obj_01)
       (pred_10 obj_32)
       (pred_4  obj_26 obj_11)
       (pred_4  obj_31 obj_05)
       (pred_4  obj_01 obj_13)
       (pred_4  obj_32 obj_05)
       (pred_2 obj_15)
       (pred_2 obj_20)
       (pred_2 obj_24)
       (pred_2 obj_23)
       (pred_2 obj_08)
       (pred_2 obj_07)
       (pred_2 obj_22)
       (pred_2 obj_25)
       (pred_2 obj_29)
       (pred_2 obj_12)
       (pred_2 obj_21)
       (pred_2 obj_06)
       (pred_2 obj_19)
       (pred_2 obj_02)
       (pred_2 obj_30)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_18)
       (pred_2 obj_03)
       (pred_2 obj_16)
       (pred_2 obj_28)

       (pred_5  obj_10 obj_11)
       (pred_5  obj_27 obj_05)
       (pred_5  obj_09 obj_13)
       (pred_5  obj_14 obj_11)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_27 obj_23)
       (pred_6 obj_09 obj_31)
       (pred_6 obj_14 obj_03)
       (pred_12 obj_03)
    )

    (:goal (and
       (pred_6 obj_27 obj_19)
       (pred_6 obj_14 obj_24)
    ))
(:constraints
  (always (not (pred_12 obj_22)))
)
)

; plan
1. (op_1 obj_03 obj_14)
   deleted: (pred_6 obj_14 obj_03) (pred_1)
   added: (pred_9 obj_14)
   goals met: 0 of 2
2. (op_3 obj_03 obj_17)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_17)
   goals met: 0 of 2
3. (op_3 obj_17 obj_21)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_21)
   goals met: 0 of 2
4. (op_3 obj_21 obj_07)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_07)
   goals met: 0 of 2
5. (op_3 obj_07 obj_20)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_20)
   goals met: 0 of 2
6. (op_3 obj_20 obj_24)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_24)
   goals met: 0 of 2
7. (op_2 obj_24 obj_14)
   deleted: (pred_9 obj_14)
   added: (pred_1) (pred_6 obj_14 obj_24)
   goals met: 1 of 2
8. (op_3 obj_24 obj_20)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_20)
   goals met: 1 of 2
9. (op_3 obj_20 obj_07)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_07)
   goals met: 1 of 2
10. (op_3 obj_07 obj_08)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_08)
   goals met: 1 of 2
11. (op_3 obj_08 obj_23)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_23)
   goals met: 1 of 2
12. (op_1 obj_23 obj_27)
   deleted: (pred_6 obj_27 obj_23) (pred_1)
   added: (pred_9 obj_27)
   goals met: 1 of 2
13. (op_3 obj_23 obj_08)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_08)
   goals met: 1 of 2
14. (op_3 obj_08 obj_07)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_07)
   goals met: 1 of 2
15. (op_3 obj_07 obj_21)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_21)
   goals met: 1 of 2
16. (op_3 obj_21 obj_06)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_06)
   goals met: 1 of 2
17. (op_3 obj_06 obj_19)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_19)
   goals met: 1 of 2
18. (op_5 obj_19 obj_10 obj_27)
   deleted: (pred_9 obj_27) (pred_6 obj_10 obj_19)
   added: (pred_9 obj_10) (pred_6 obj_27 obj_19)
   goals met: 2 of 2
